
public class Main {

	public static void main(String[] args) {
		/*
		 * 3월 6일(월) ~ 3월 12일(일) 회고록
		 * 
		 * 이번 주 학원의 주된 수업 내용은
		 * 다이어그램에 대해 배우고 직접 그려보는 시간이었다.
		 * 개발 전 전체적인 그림을 그려보는 과정이 나름 중요하다라는 것을 꺠달은 시간이었다.
		 * 
		 * 다이어그램은 참 많은 생각을 하게 했고,
		 * '얼마나 디테일한가에 따라 결과가 달라질 수 있곘다' 싶었다.
		 * 
		 * 뭐 집에서는 To-do-list를 바닐라 자바 스크립트로 하고 있고
		 * 물론 아직 부족하지만, 이리저리 구글링하며 찾아 직접 코드를 만들어
		 * 나름 많이 구현했다고 생각하고 뿌듯하다.
		 * 
		 * 또한 정보처리기사도 공부 중이다만,
		 * 이거는 참 왜이렇게 외울 것이 많은건가~~~
		 * 터무니 없는 양이지만, 하루하루 할당량을 채워가면 잘 되겠지라는 생각이다.
		 * 
		 * 그리고 Evernote를 만들어 더 작성 중에 있다.
		 * Github만으로 나를 어필하는 것은 요즘 같은 경쟁 시대에
		 * 부족할 것 같다는 생각에 시작하게 되었다.
		 * 
		 * 체크리스트를 만들어서 하나하나 체크해가며 하고 있는데
		 * 하루에 할 게 정말 많다.
		 * 근데 그래도 내 스스로가 굉장히 부족하다고 느낀다. 
		 * 참 아이러니한데, 일단 당장 밥값은 할 수 있게 만드는 것이 목표이며
		 * 늘 하는 말이지만.. 묵묵히 정진하는 수 밖에 없는 것 같다.
		 * 
		 * 오늘도 화이팅하자 정원아.
		 * 안되면? 될 때까지!
		 * 
		 * 
		 */
	}

}
